:PROPERTIES:
:ID:       02ce83ed-31b4-4906-89e4-271bbf432834
:END:
#+title: std::unique_ptr
#+filetags: cpp

* Footnotes
[fn:2]
#+begin_src cpp :results output :namespaces std :includes <iostream> <memory>
class Resource
{
public:
	Resource() { std::cout << "Resource acquired\n"; }
	~Resource() { std::cout << "Resource destroyed\n"; }
};

std::ostream& operator<<(std::ostream& out, const Resource&)
{
	out << "I am a resource";
	return out;
}

// The function only uses the resource, so we'll accept a pointer to the resource, not a reference to the whole std::unique_ptr<Resource>
void useResource(const Resource* res)
{
	if (res)
		std::cout << *res << '\n';
	else
		std::cout << "No resource\n";
}

int main()
{
	auto ptr{ std::make_unique<Resource>() };

	useResource(ptr.get()); // 获取资源本身

	std::cout << "Ending program\n";

	return 0;
} // NOTE NOTE NOTE 资源在此处释放，ok：也就是说 调用完函数，回到 main，资源依旧被 std::unique_ptr 管理着
#+end_src

#+RESULTS:
: Resource acquired
: I am a resource
: Ending program
: Resource destroyed


[fn:1]
#+begin_src cpp :results output :namespaces std :includes <iostream> <memory> <utility>
class Resource
{
public:
	Resource() { std::cout << "Resource acquired\n"; }
	~Resource() { std::cout << "Resource destroyed\n"; }
};

std::ostream& operator<<(std::ostream& out, const Resource&)
{
	out << "I am a resource";
	return out;
}

// 这个函数获取 资源的管理权，这不是我们想要的
void takeOwnership(std::unique_ptr<Resource> res)
{
     if (res)
          std::cout << *res << '\n';
} // NOTE NOTE NOTE资源在此释放；这不是我们想要的

int main()
{
    auto ptr{ std::make_unique<Resource>() };

    //    takeOwnership(ptr); // FIXME 错误，std::unique_ptr 没有拷贝语义
    takeOwnership(std::move(ptr)); // 使用移动语义

    std::cout << "Ending program\n";

    return 0;
}
#+end_src

#+RESULTS:
: Resource acquired
: I am a resource
: Resource destroyed
: Ending program
